{
    "version": "https://jsonfeed.org/version/1",
    "title": "de·con·struct",
    "description": "",
    "home_page_url": "https://blog.aloui.se",
    "feed_url": "https://blog.aloui.se/feed.json",
    "user_comment": "",
    "author": {
        "name": "thelastinuit"
    },
    "items": [
        {
            "id": "https://blog.aloui.se/open.html",
            "url": "https://blog.aloui.se/open.html",
            "title": "Open",
            "summary": "What a mess we made; trying to prove we don't need each other. Ginnie Bale This is a long time post coming. The first paragraph should be the introduction, information what will tell you all and leave you in mystery. But, I'm having trouble doing&hellip;",
            "content_html": "<blockquote>\n<p data-pm-slice=\"1 1 []\">What a mess we made;<br>trying to prove we don't need each other.<br><br><strong><em>Ginnie Bale</em></strong></p>\n</blockquote>\n<p data-pm-slice=\"1 1 []\">This is a long time post coming. The first paragraph should be <strong>the</strong> introduction, information what will tell you all and leave you in mystery. But, I'm having trouble doing that. For one, you already know all of this or at least you <em>know</em> it. Two, I'm not a writer nor I'll ever be. I do enjoy writing stuff. Most of them are either crazy, controversial, nonsensical or all of them at once. Why would someone write those stuff let alone has those thoughts? <strong><em>I dunno</em></strong>. I'm not here to explain why I have those thoughts. I'm only sharing them<em> just 'cuz</em>. So, let me finish this paragraph in a controversial way. I do think we are in a very delicate situation where our civilization is in danger to collapse.</p>\n<p data-pm-slice=\"1 1 []\">We have environmental issues. We have social issues. We have health issue. We have financial issues. You get the idea, don't you?. It is not nice out there. Sometimes I wonder how someone cope with it. And then I notice we are distracted all the time. Our attention span got hijacked. I don't mean in a conspiratory sense. It is true, though.</p>\n<p data-pm-slice=\"1 1 []\">I recently started an experiment. It wanted to find out if my excuse for not having<em> digital </em>social networks, IMs, etc, was because I didn't find value in those or because I was so afraid of rejection, of connection with others, that I put those away. I had all mainstream social networks. I used a lot. People did connect with me more. I engaged old friendships and such. It was a great experience. So, it means the issue was <strong>me</strong>. After that accepting that, I closed everything. Now, I'm looking to connect in a more direct way: <strong>calls</strong>, in <strong>person</strong>, or <strong>e-mail </strong>(<em>perhaps even letters like we used to</em>).</p>\n<p data-pm-slice=\"1 1 []\">That experiment led me to other stuff. By sheer coincidence (<em>is it, though?</em>), I was reading <em>Sacred Economics </em>by <em>Charles Eisenstein.</em> Let me tell ya how many things of he said vibed with me. </p>\n<p data-pm-slice=\"1 1 []\">I became a scientist (<em>not a man of science</em>) because I believe knowledge is a good thing for our <strong>progress</strong> as a civilization. I wanted to see how far we can go to become a intergalactic civilization. Yeah, it sounds crazy. I know and I don't care. I do believe with more than 7 billion brains, we can for sure become one in our <em>lifetime</em><strong>.</strong></p>\n<p data-pm-slice=\"1 1 []\">But progress is curious word. I dunno what direction to take. I assume us become an intergalactic civilization is a good thing. Is it, though? Looking down to our planet... well, I don't think so anymore. We do have this capacity for <em>creation</em> but that power is also the mirror of our capacity to <em>destruction</em>. I dunno how to deal with idea. I dunno how to solve it.</p>\n<p data-pm-slice=\"1 1 []\">A few years ago I came up with this plan with three main objects:<strong> energy, A.I.</strong> and <strong>transportation</strong>. Believe it or not, solving the energy problem and transportation for interstellar travel problem <strong>is</strong> easy in comparsion with <strong>A.I. </strong>A.I. is also <em>easy. </em>The problem is with such technology... how can I know we are not going to destroy ourselves? Right now, for example, A.I. is getting better and better. Experts are worried. That's not even close to what I have envisioned. I wanted to be a <a href=\"Kardashev scale\" target=\"null\">Civilization Type II</a>. For that, I believe we need technology that allow us to scale. And that scalation is only possible through some A.I.</p>\n<p data-pm-slice=\"1 1 []\">Now, my eyes are not pointing to the stars. I'm looking within. I'm looking for a way to help humanity to go to the next level and let that task to become interstellar to someone else.</p>\n<p data-pm-slice=\"1 1 []\">And that perhaps is why Eisenstein's book came in such a great point in my life. I've never like the way we do economics. I disliked money very hard. I've earned money, a lot but it felt wrong. I tried to help as many people as possible. Now I'm not earning as much as before but there is some happiness also some sadness for things I cannot do anymore but that's ok. Just like Eisentein said:</p>\n<blockquote>\n<p data-pm-slice=\"1 1 []\">We can engage in conscious, purposeful money destruction in place of the unconscious destruction of money that happens in a collapsing economy. If you still have money to invest, invest it in enterprises that explicitly seek to build community, protect nature, and preserve the cultural commonwealth. Expect a zero or negative financial return on your investment-that is a good sign that you are not unintentionally converting even more of the world to money. Whether or not you have money to invest, you can also reclaim what was sold away by taking steps out the money economy. Anything you learn to do for yourself or for other people, without paying for it; any utilization of recycled or discarded materials; anything you make instead of buy, give instead of sell; any new skill or new song or new art you teach yourself or another will reduce the dominion of money and grow a gift economy to sustain us through the coming transition. The world of the Gift, echoing primitive gift societies, the web of ecology, and the spiritual teachings of the ages, is nigh upon us. It tugs on our heartstrings and awakens our generosity. Shall we heed its call, before the remainder of earth’s beauty is consumed?</p>\n</blockquote>\n<p data-pm-slice=\"1 1 []\">For now, I will play the game a bit so I can move around. But at the same time, I will do whatever I can to make a change. Let us hope for a better future, an <strong>open</strong> future for our species. We can do it. I, for one, believe we can.</p>",
            "author": {
                "name": "thelastinuit"
            },
            "tags": [
            ],
            "date_published": "2023-08-01T11:14:34-05:00",
            "date_modified": "2023-08-03T17:27:48-05:00"
        }
    ]
}
