{
    "version": "https://jsonfeed.org/version/1",
    "title": "de·con·struct",
    "description": "",
    "home_page_url": "https://blog.aloui.se",
    "feed_url": "https://blog.aloui.se/feed.json",
    "user_comment": "",
    "author": {
        "name": "thelastinuit"
    },
    "items": [
        {
            "id": "https://blog.aloui.se/neri.html",
            "url": "https://blog.aloui.se/neri.html",
            "title": "Neri",
            "summary": "If you love someone, love it completely, cherish it, say it, but most importantly, show it. Life is finite and fragile, and just because something is there one day, it might not be the next. Never take that for granted. Say what you need to&hellip;",
            "content_html": "<blockquote>\n<p class=\"quoteText\">If you love someone, love it completely, cherish it, say it, but most importantly, show it. Life is finite and fragile, and just because something is there one day, it might not be the next. Never take that for granted.<br><br>Say what you need to say, then say a little more.<br>Say too much. Show too much. Love too much.<br><br>Everything is temporary but love.<br>Love outlives us all.</p>\n<p><strong>R.Q.</strong></p>\n</blockquote>\n<p>One of the things that one hear in the spiritual community is to find yourself, to know who you truly are. Know thyself, they say. Through the eyes of others, I have found myself. </p>\n<p>That little kid who finds love in everything, who feels everything, who feels too much perhaps. It was me but along the way of growing as human being in this civilization somehow I lost it. But throughout the years I have also been recovering pieces of me.</p>\n<p>I used to fall in love deeply. I used to feel a lot. My parents even tried to take to some psicologists. I cannot recall what they say but it didn't help. Perhaps they knew I was just a sensitive kid.</p>\n<p>My father seeing that (and missing some other tragic stuff), and naive as he was, he went raw to the point of being me verbally abused. He wanted me to be tough. Life's hard so he got worried. Didn't help.</p>\n<p>One thing I recently thanked him was that he knew he was hard on me. Every time, at night, one I was sleeping, he would be next time asking me for forgiveness.</p>\n<p>I have no idea how I came to be the way I am. Maybe it was meant to be but some many things happened to me that it is a miracle I'm not dead or a complete asshole.</p>\n<p>I'm so lucky.</p>\n<p>So, let me expose myself and say the following. I do believe that love is something we don't understand yet. I wanted to believe so many years to be just a chemical reaction in the brain but I was wrong and deep downd I knew it.</p>\n<p>I believe in love. </p>\n<p>I believe it can transform the collection consciousness for the better.</p>\n<p>I have no idea how but I must find the way even when it's impossible.</p>",
            "author": {
                "name": "thelastinuit"
            },
            "tags": [
            ],
            "date_published": "2023-09-24T10:36:59-05:00",
            "date_modified": "2023-09-24T10:53:13-05:00"
        },
        {
            "id": "https://blog.aloui.se/my-own.html",
            "url": "https://blog.aloui.se/my-own.html",
            "title": "My Own",
            "summary": "Strange is our situation here upon earth. Each of us comes for a short visit, not knowing why, yet sometimes seeming to a divine purpose. From the standpoint of daily life, however, there is one thing we do know: that we are here for the&hellip;",
            "content_html": "<blockquote>\n<p>Strange is our situation here upon earth. Each of us comes for a short visit, not knowing why, yet sometimes seeming to a divine purpose. From the standpoint of daily life, however, there is one thing we do know: <strong>that we are here for the sake of others.</strong></p>\n<p>A.E.</p>\n</blockquote>\n<p>Those who knows me, knows me deeply, would say: <em>yeah, he is batshit crazy... but, you know, somehow, he does make sense regardless of how crazy it sounds</em>. They are talking about how I see reality, the human experience, love and other subjects. Indeed, If I try to be objective about myself, I would say the same thing to me: <em>what the fork are you talking about?</em></p>\n<p>Nonetheless, I can tell you from the bottom of my heart that I mean it, I feel it, my intuition is guiding me and my heart talks and I follow. Always. Contrary to what people expect from such claims, that does not mean what I get it's going to be something good. Neither it's going to be something bad. But it always will be something that you need to experience it.</p>\n<p>It is funny, though. I don't think reality is what we perceive. We hardly see the whole thing. And yet... why I feel so sure about my claims? I cannot reason with ya on that. I will tell you for you own good, call me crazy. I don't listen to me. This is crazy.</p>\n<p>Long time ago I came to the conclusion, or rather my belief, that reality is relation. A relation between more than two things. You can called <em>Trinity</em>, if you will. From that, other conclusions started to appear in my head and from that... I have arrived to today.</p>\n<p>I have no idea how we came to the conclusion what we don't need each other. But I'm not here to change that nor to go against it. I'm here to live what I preach: <em>I will hold your heart more tenderly than my own.</em></p>\n<p class=\"msg msg--highlight \"><em>To be is to be perceived, and so to know thyself is only possible through the eyes of the other. The nature of our immortal lives is in the consequences of our words and deeds, that go on and are pushing themselves throughout all time.</em><br><em>Our lives are not our own. From womb to tomb, we are bound to others, past and present, and by each crime and every kindness, we birth our future.</em></p>\n<p> </p>",
            "author": {
                "name": "thelastinuit"
            },
            "tags": [
            ],
            "date_published": "2023-08-24T10:21:16-05:00",
            "date_modified": "2023-08-24T10:21:16-05:00"
        }
    ]
}
