{
    "version": "https://jsonfeed.org/version/1",
    "title": "de·con·struct",
    "description": "",
    "home_page_url": "https://blog.aloui.se",
    "feed_url": "https://blog.aloui.se/feed.json",
    "user_comment": "",
    "author": {
        "name": "thelastinuit"
    },
    "items": [
        {
            "id": "https://blog.aloui.se/littleness.html",
            "url": "https://blog.aloui.se/littleness.html",
            "title": "The irony of man&#x27;s condition",
            "summary": "Man cannot endure his own littleness unless he can translate it into meaningfulness on the largest possible level. Ernest Becker A few years ago I came up with an impossible plan: to leave blueprints to become a intergalactic civilization. After few decades on this planet,&hellip;",
            "content_html": "<blockquote>\n<p>Man cannot endure his own littleness unless he can translate it into meaningfulness on the largest possible level.</p>\n<p><strong>Ernest Becker</strong></p>\n</blockquote>\n<p>A few years ago I came up with an impossible plan: to leave blueprints to become a intergalactic civilization. After few decades on this planet, I have come to the conclusion that I can only conquer what it is within, not. Not even that.</p>\n<p>I called it ASTECH, short for Asgan Technologies. The plan was to create the neccesary technology to be an intergalatic civilization. It was impossible not because of the goals but because it was only me. I assumed nobody would believe the mission was possible. In some sense, it was a stupid plan. Perhaps crazy.</p>\n<p>I created it after I finished reading the book <em>The Denial of Death </em>by <strong>Ernest Becker</strong>. My conclusion was to have an impossible goal where I can focus all my energy and create the best legacy I could leave behind. I was aware I wouldn't be able to make it but it was good enough to keep me away from my stupid fragile existence.</p>\n<p>Part of me, the half of me, doesn't see any point to this. All this suffering. All this asymmetry in the Universe is not worth it. <em>To live fully is to live with an awareness of the rumble of terror that underlies everything.</em> The othe half, well, likes to believe there is a point to all of this even to death and the so-called afterlife.</p>\n<p>Do you know what I fear? It's not death but eternity. After all I have seen, eternity is the actual terror in my stupid little life. </p>\n<p>To make matter worse, I thought I didn't want to have kids and get married like normal people do. Now, my body, my desires are different. It's all a forking cosmic joke.</p>\n<p>So, what now? I came up with a plan. A new plan. I want to leave a legacy. A worthy legacy. I think if we can conquer ourselves from within, we can conquer anything. We can stop being so self-destructive and actually get to live longer and why not an eternity. Not me, tough. At my age will end up single but not alone. And if every person I love is gone before the eternity solution, I see no point in this. It's too much.</p>\n<blockquote>\n<p>The irony of man's condition is that the deepest need is to be free of the anxiety of death and annihilation; but it is life itself which awakens it, and so we must shrink from being fully alive.</p>\n<p><strong>Ernest Becker</strong></p>\n</blockquote>",
            "author": {
                "name": "thelastinuit"
            },
            "tags": [
            ],
            "date_published": "2023-08-11T01:11:29-05:00",
            "date_modified": "2023-08-11T01:31:55-05:00"
        }
    ]
}
